[
  {
    "title": "Predatory Tribal Loans from the Internet - what to do to break out of the cycle",
    "subreddit": "Debt",
    "date": "2024-10-01",  
    "url": "https://www.reddit.com/r/Debt/comments/1glwt7l/predatory_tribal_loans_from_the_internet_what_to/",
    "text": "Tribal loans - can you really just stop paying them and forget them? The biggest concern is that they have arbitration agreements and I am concerned about being sued, taken to court, having wages garnished, being sent to collections, etc.\n\nI have never been in debt. I took 4 small loans (less than $1,000) each to try to get quick money to pay off medical and hospital bills. Turns out these are predatory scams. No wonder they were instant approval.\n\nI've seen advice that says these are not enforceable and you should just block payment and revoke ACH then challenge it if it goes to collections. Can I really do that? Don't I at least owe the original money I borrowed? Or is it just 'free money' then?\n\nHere is what it breaks down to -\n\nThree Sticks Lending - borrowed $700. Payments are $187.46 every 2 weeks\nAscend Loans - borrowed $600. Payments are $145.17 every 2 weeks\nSpotloan - borrowed $500. Payments are $91.14 every 2 weeks\nPost Lake Lending - borrowed $600. Payments are $90.96 every 2 weeks\n\nRates are 600% to nearly 780%.\n\nI did sign their online terms to agreement and stuff so does that mean I am legally obligated to pay?\n\nOnce I go back to work full time, I could pay them off quickly. Would that be better and easier than the hassle of non-payment?\n\nI am currently still on maternity leave not making full pay, so I can't pay any off RIGHT now but I will be able to soon. Should I really just ignore them?\n\nI called my bank and got a stop payment on all 4. So do I just ignore all debt attempts now? Are they going to try to sue me? Will I be ok just ignoring them and not paying?\n\nI am from Ohio btw\n\nThis is definitely something I will never ever do again. I am just worried now that I've signed the documents, they will be able to take me to court, garnish my wages since they know where I work or my credit will be ruined if I do stop paying them.\n\nI saw another story on here about predatory loans like these that said they stopped paying them, blocked their number/email and literally never heard from them again and had no issue. Is that really that simple? I'm so scared about not paying them. I'm scared I even did the stop payment. I feel like they're going to file legal action against me and really get me in trouble.\n\nMy bank said if the stop is successful, I won't lose the money, but if we had a bonding agreement and the stop is unsuccessful, then it'll still be taken from my account.\n\nAnyone that can offer input would be appreciated. I feel so stupid! I just wanted to quickly pay off my medical bills.\n\nEdit - I have stopped payment on all 4 loans from my bank and also called them to revoke ACH. 2 of them have sent email confirmation that the ACH was revoked."
  },
  {
    "title": "*Please* never get a payday loan",
    "subreddit": "povertyfinance",
    "date": "2018-04-01",  
    "url": "https://www.reddit.com/r/povertyfinance/comments/96d4dz/please_never_get_a_payday_loan/",
    "text": "This is an embarrassing situation I got myself into. I want to share for anyone considering a payday loan. My first payday load was $700. When my checks would come in I had other bills I needed to pay first and just paid interest. I paid this loan off finally after 14 weeks. Total of $980 in interest. After that loan was paid I needed some more cash for bills a few months later. $1,000 payday loan. Again, when my checks came in, other bills had to be paid. Took 20 weeks to pay it off. $2,050 paid in interest. Total of $3,030 paid in interest for a $1,700 dollar loan. Just don’t do it. I would have been better off paying every single bill late and just paying a late fee. I felt desperate at the time but getting those loans did not help. I have a lot of shame around money and took these loans so I wouldn’t have to call those I owed and tell them I had to pay late. $3,030 down the drain to save myself from a few moments of embarrassment.",
  }.
  {
    "title": "I hate payday loan companies.",
    "subreddit": "personalfinance",
    "date": "2019-04-01",
    "url": "https://www.reddit.com/r/personalfinance/comments/gdladj/i_hate_payday_loan_companies/",
    "text": "Quick tip: if you're 18 don't trust the loan officer at the beat up shack saying she can give you $1,000. Storytime: I moved out of my family house at 17 without any financial guidance. Moved into a little 2 bed rent house with a friend, both of us had a little job that could 100% pay for everything we needed. I was never taught finances, credit, or anything important concerning money or savings by my parents. This was probably the biggest disappointment ive ever come to realize, especially after having my daughter. It is essential to teach your children the importance of finances, critical! I had none. After about 6 months in this rent house we decided to go our separate ways and get our own places. By this time I had turned 18. So i applied for a little appartment for just about $800 a month, nothing crazy and i was making a little more than that a month so in my uneducated 18 year old mind that was a great idea. After doing this and barely scraping by for months i came up short on rent one month and it was between taking a loan out to pay for the rent, keeping the lights on or being evicted.(why did i think this was a good idea? For some people, they are educated in the world of what to do with money and what not to do. My knowledge of finances does not come from anyone except my own experiences) So of course as any dumb 18 year old with no finance experience did, i took a $1,000 loan out to pay my rent... I went to the local payday shop (WF) and went to the lady and asked for $1,000 (easy enough right?) Lol. She noded to her coworker and handed me some silly papers to fill out. I obliged. I mean whats the worst that can happen? Signed their papers and left with $1,000 to pay rent. Of course in my head at the time i could definitely afford the $160 a month they offered to help me with. Sounded great to me, $1000 dollars now and just pay them back over the months. It was $160 for 12 months... I ended up not being able to pay rent and the payday loan sharks back so obviously being an idiot, i paid rent, and let that loan shark eat my credit to oblivion. They sent my balance of like ~ $1600 to collections. No big deal for an 18 year old uneducated college dropout right? For 2 years after that i never batted an eye at that collections account nor my credit, i didnt care about their money. Until.... I started to learn what runs the world. Credit, savings, budgeting, etc. It hit me really hard into tears when i found out that my ignorance and my parents incompetence had costed me years of my life to repair. I applied to buy a vehicle because mine had bitten the dirt and the carsalesmen laughed at me and told me a 460 cannot buy a vehicle. Men cry too. I cried. At this time when i started to find out about finances and credit i was 20-21 and never knew this secret life of credit that was hidden from me from the people who were suppose to set my life in the right way. I was devastated, i was making $5,000 a month at 20-21 thinking i was top dog, when in real life i wasnt crap. I had a delinquent account from the loan sharks, a charged off light bill, and a secure loan totaling ~$3500 in balances. Of course around this time, even though i was making decent money (for my area in my state and area average income is 3,000 a month or less) but with more money, more problems. I was still fairly new to budgetting saving and credit and had been wasting my money on stupid crap and clocking up bills like i was a millionaire. Although i was making $5,000 my bills ate up ~$4000-$4,500 and was living check to check so i had no money to pay off the sharks and they continued to ruin me. Finally I came to the greatest job i think ill ever have, my elders here adviced me since i was 22, and helped put my financial life back on the track it never was. I cut my bills to below $2,000 paid the loan sharks and have been able to save and invest and grow my money. After 8 years of leaving my parents house my credit is now at 620, and i am in the position financially to buy a house, only for the coronavirus to raise minimum's to 640. Im upset with myself, my parents, loan sharks and the system of education surrounding these institutions. There should be more regulations to age or something to keep people from having to resort to these terrible loan institutions that destroy peoples lives. There should be classes in highschool for kids like me, who's parents never cared enough to teach them life. There should be credit programs at jobs to teach employees how to save invest and not make uneducated decisions. All of this will amd probably has already created a subclass of people who are stuck like me and it devastates me everyday. I am 25 now. I understand this is a TERRIBLE CHOICE and I hope to help any one out that might have had the same upbringing as me, i cannot stress this enough, MY PARENTS DID NOT CARE ENOUGH ABOUT ME TO TEACH ME SIMPLE LESSONS IN FINANCE NOR MONEY MANAGEMENT. Tl;dr: uneducated in finances, loan sharks are the devil, parents need to teach kids about this and have there backs after highschool.",
  },
  {
    "title": "Payday Loan Help",
    "subreddit": "DebtAdvice",
    "date": "2025-04-09",
    "url": "https://www.reddit.com/r/DebtAdvice/comments/1jw6aru/payday_loan_help/",
    "text": "Hi guys! I could use your help. Right now I have a total balance of just under 17K. I’m currently paying 3k a month on these loans and have have paid about 30K in total already. There are in total 6 payday loan companies accounting for 13k of the 17k. With interest rates ranging between 150% to 598%. The rest of my bills are: 1300 -rent 225 -internet/tv 130ish -utilities 455 -car payment 100 -car insurance 170 -dogfood 60 -dogs nails trimming 120 -other subscriptions It’s overwhelming. I work as a clinical pharmacist for a hospital right across the street from my apartment. I’m a top employee and have 100% job security. I am lucky that the nonprofit hospital I work for has had no issues, compared to some of the for profit ones in the area. I bring home at least 3200 every two weeks (base pay then additional pay based on shift type) I took out a couple loans because I was trying to support myself as well as a girl at the time, long story short it didn’t work out. I thought I could pay them off over time easily, but it grew stressful. I eventually took out a few more to help cover the originals. I thought by giving myself a break from a month of the payments with new loans that I’d be able to start to get out of them. Because of these loans and falling behind on smaller credit cards my credit score is around 540. I’ve been applying for debt consolidation loans, but I haven’t been accepted yet. Does anyone know where I could get one? I don’t think I can find a cosigner. I have possibly one person I could ask. Currently I’m eating ramen every single day, sometimes twice a day as my only meal. Maybe twice per pay period I will eat a frozen pizza that I get from the store for $7. I’m also trying to cancel unnecessary subscriptions. It’s just been impossible to get ahold of spectrum to cancel my tv portion of the bill. I will take literally any and all advice on how to solve this. Literally even if I had to pay 1500 a month on these loans it would be a massive weight off my shoulders.",
  },
  {
    "title": "Buried in Payday loan debt, want to find my way out (desperately)",
    "subreddit": "personalfinance",
    "date": "2024-04-01",
    "url": "https://www.reddit.com/r/personalfinance/comments/1aeyw6z/buried_in_payday_loan_debt_want_to_find_my_way/",
    "text": "For the better part of a year I’ve been digging myself into a hole with debt. I’ve recently began counseling to address the gambling issues I have that lead me to this place. I earn a decent wage but currently all of it is being eaten alive by the monstrous APR on these shark loans. I’ve always had debt but have always been able to pay.. with the addition of these shark loans it’s made it to where I’m starting to have to get.. creative with my payment dates and I’m feeling the strain of my choices harder than ever. I’m just wondering if there is any advice somebody has for paying these off in a manner that wouldn’t have me paying the minimum due until the duration of the loan is complete. I’ll start by saying I’ve been paying some of these longer than others. All of them will be paid off in 2024 if I just stick to the minimums.. but it will cost me $35,000-50,000 in wasted income if I do that. I have other types of debt that I’m not going to list out, I’ll try to just focus on the shark loans.. from left to right it’s amount owed, APR, and bi-weekly payment due. I know there is some information that may be necessary to know in order to get a better understanding of how I can pay these off. My current gross income is $7,100 per month. My currently monthly expenses with all of my debt and rent and everything is currently $8,750. Loan #1 — $780 — 762% APR — $210 Loan #2 — $803 — 740% APR — $141 Loan #3 — $1,129 — 698% APR — $195 Loan #4 — $1,251 — 599% APR — $250 Loan #5 — $1,425 — 594% APR — $225 Loan #6 — $1,885 — 525% APR — $275 Loan #7 — $1,312 — 494% APR — $238 Loan #8 — $1,136 — 474% APR — $209 Loan #9 — $1,030 — 224% APR — $100 Loan #10 — $1,556 — 160% APR — $133 Loan #11 — $1,235 — ??? APR — $100 Loan #12 — $793 — ??? APR — $129",
  },
  {
    "title": "Payday Loan Hell / Options?",
    "subreddit": "personalfinance",
    "date": "2018-04-01",
    "url": "https://www.reddit.com/r/personalfinance/comments/847x8j/payday_loan_hell_options/",
    "text": "Payday Loan Hell / Options? Debt Throw-a-way account for obvious reasons. Had a sort of traumatic experience a few years ago that temporarily hindered my ability to work. Instead of actively seeking the help from professionals and friends/family, I tried to continue as normal and just cut my expenses. It started off as one loan that I immediately paid back after my 'non-rent paycheck' Few months later, I pulled the trigger again but was unable to pay back in full and it snowballed.. Currently, I have 5 maxed out credit cards and 4 loans, 3 with absurd APR that are higher than my state's law (does this matter in any way?) I was making minimum payments on each for awhile but I'm mentally/physically broken down at this point and can't afford to even get groceries/go to the doctor, let alone find the capital to attack this. It feels like I've woken up from a bad dream and feel really helpless. At this point, 2 of my credit card payments are vastly behind I'm still making minimum payments on the others. Collection calls are starting to come in and it's hard for me to mentally handle this/know what to do at this point. I've already called Capital One to set up a payment plan on money I owe them (got it current) but there's a less reputable company that I'm behind with and I'm scared to answer/call them because I simply don't have the capital and don't want to promise a payment I can't make to get it current. I've done the basics of severely reducing expenses Summation: ->Terrible life decisions by myself had led to a massive amount of debt that I need relief/payment plan ->Majority of the overwhelming APR is coming from online pay-day lenders and lack of making payments This is all my responsibility and I am cognizant I need to get myself out of this situation by myself, but if anybody with experience can point me to/give advice on anything from initial contacts to bankruptcy lawyers or anything that would help, please PM I found the credit card companies are pretty reasonable to deal with if you are straight forward with their reps, but interest on the loans are killing me and I find them really hard to deal with. EDIT for specifics. I know it seems foolish to most I didn't initially list all of my debts, but I think subconsciously I was looking for re-affirmation of choosing basic life necessities over credit score. And..well I'm embarrassed. Credit Cards Current: Capital One- $1500 (50 monthly / 22% APR) Capital One (2). $450 (20 monthly / 22% APR) Credit One - $1,050 ( 55 monthly / 29% APR) Credit One (2) - $650 (30 monthly / 20% APR) Terrible Company 1 - $675 (45 monthly / 35 ish APR) Paypal Credit - - $700 ( 50 monthly / 23 APR) Terrible Company 2 - Owed $1000 ish but missed payment and they have sent a collection notice letter. With penalties and late payments fees the minimum they want now is 400. I can't do it. **Amazon - 3500 limit..have used around 2500 and APR is around 25%...dipped into this to get cash advances to pay for basic life supplies while making payments on these loans. last payment was 70 but should shoot up since I get a lot of cash out. Am scared. Total Monthly: 320 ish + the delinquent one not sure what to do with Total Owed: $8,525 Loans: Legit Mariner Finance - 39% APR - $96 monthly ($1,600 total) Online Crazy Loans A) $125 monthly // 970 total // 299% APR B) $148 monthly // $1,100 total // $450 % APR C) $197 monthly // $600 total // 399% APR The main problem with the online loans (and looking back I can't believe I let myself get into a mental state where i even friggin considered these loans without reaching out for help/better options) is that the phrasing on the initial contracts sort of tricked me. There's a finance charge as well as ridiculous interest so for the C one the minimum monthly won't even touch the principal for another few months.",
  },
  {
    "title": "Payday loan nightmare - venting, feedback/advice welcome. It’s temporary.",
    "subreddit": "Debt",
    "date": "2024-12-01",
    "url": "https://www.reddit.com/r/Debt/comments/1hsc2x7/payday_loan_nightmare_venting_feedbackadvice/",
    "text": "So let me put the back story in a nutshell, I filed chapter 13 bankruptcy in August after paying the filing fee in installments for 8 months. During my initial bankruptcy consultation, they told me to expect to pay 400-500 a month. Well I’m paying 1625 a month, lol, a little off forecast, and did not expect this when my payments began in September, so there went whatever I had saved. This really screwed me, I had things I needed to do, including going to visit my sick mother in Florida. So I needed extra cash, so I took out a payday loan, whatever, then another, then another. I did stop, however not before totaling about 6 of them, taken out between late October and the last one first week of December. So I’ve been paying them down all since then, on top of my rent, bills, pet food, groceries. Some of them I’ve paid or close to the principal amount. After this check though, I am no longer going to be able to keep up with these, or at least all of them. However, in march, I am getting a bonus and raise from work that will allow me to remove myself out of this spiral of nauseating payday loan debt. Next due dates are Jan 15th and I’ll get my bonus round march 15th, I’m thinking of diverting my direct deposit to my other account, to avoid them taking it out, versus closing the account, also disabling the overdraft option. But my plan is to is to try and maybe pay one off in full every two weeks (if I can) and then paying whatever’s left due in march; but then another part of me wants to stop paying them completely for two months, and then calling them all in march and paying them all off, even if they’re in collections at that time, my fear of stopping payments for two months completely is being sued and summoned to court before I get my bonus and they garnish my wages. Thanks for reading. Open to feedback, opinions.",
  },
  {
    "title": "Just found out I was given a predatory loan",
    "subreddit": "Assistance",
    "date": "2024-09-01",
    "url": "https://www.reddit.com/r/Assistance/comments/1ftvdhu/just_found_out_i_was_given_a_predatory_loan/",
    "text": "I didn’t have enough for rent and needed a $900 loan. I just found out that a loan I got was predatory and it has a 690% interest rate. I swear it was initially 6.9% What should be my last payment is Friday and I find out the $900 loan is actually $4000!!! For $1072 I can pay it off and be done. Problem is, all my expenses are about to take away my check. Idk what to do and I can’t post in r/Borrow yet.",
  },
  {
    "title": "Paying off predatory loan and preserving right to sue",
    "subreddit": "legaladvice",
    "date": "2024-04-01",
    "url": "https://www.reddit.com/r/legaladvice/comments/1ce200e/paying_off_predatory_loan_and_preserving_right_to/",
    "text": "Location, Florida. Company, California LLC Ascend Loans. The company is currently under class action lawsuit in Illinois for predatory loans. An old family friend took out a $900 loan from Ascend LLC with an almost 700% interest rate. She has almost the whole principal remaining. Same facts as the case described here. I’m going to pay it off ASAP regardless. Is there anything I can do to preserve a claim against this company? Can I do something to give myself standing so I can take action for my friend. I don’t care if it has no monetary worth. I’ll pay the filing fee just to make the bastards have to pay for an attorney. Im literally daydreaming about getting a default judgment and filing a lien on them. I have the contract, I’ll review that tomorrow and see if there’s some bs arbitration clause or forum selection clause for updating, but that can be dealt with after preserving a claim, if possible. Tell me I have an outlet for my righteous fury!",
  },
  {
    "title": "CMV: Payday loans (and other high interest loans, but we're mainly talking about payday loans here) should be outlawed",
    "subreddit": "changemyview",
    "date": "2023-04-01",
    "url": "https://www.reddit.com/r/changemyview/comments/1269yht/cmv_payday_loans_and_other_high_interest_loans/",
    "text": "CLARIFICATION: I mean capping interest rate (APR) at (inflation rate+20%) Reason 1: Most apparent reason, it's predatory. Interest rates are So. Damn. High. And it's often compound interest plus penalties once you fail to repay in time. As many as 64 percent of people have to renew their payday loan, resulting in interest money skyrocketing and only 15 percent of borrowers repay all of their payday debts when due without re-borrowing within 14 days; 20 percent default on a loan at some point. Source: https://www.consumerfinance.gov/about-us/newsroom/cfpb-finds-four-out-of-five-payday-loans-are-rolled-over-or-renewed Reason 2: Those in real dire need of payday loans are usually poor people, these loans are sucking the blood out of them to benefit the capitalists. The government can issue welfare benefits that don't need to be repaid (for the most needy people), interest-free loans (for the next most needy people) and low-interest loans (for "normal" people who need money for an emergency) to help them, and maybe also put more fund into the healthcare industry (like maybe fund a compulsory basic health insurance) so people don't go broke with a single illness if they don't have one of those notoriously expensive private insurances. Reason 3: Payday loans are often hard to distinguish from illegal loan sharks, and confused people may accidentally choose an illegal, violent loan shark when they want to use a legal payday loan. If we just outlaw any loan with an annual interest rate of greater than (inflation rate+20%), people would easily know it's illegal.",
  },
  {
    "title": "Ridiculous fees from payday lenders",
    "subreddit": "toRANTto",
    "date": "2024-06-01",
    "url": "https://www.reddit.com/r/toRANTo/comments/1di22ue/ridiculous_fees_from_payday_lenders/",
    "text": "A friend needed money badly last week but couldn’t get his bank to approve a LOC. After googling, he landed on one of those companies that advertise payday loans with no credit check. He applied for a 1000$ loan, got approved and got sent a contract to sign. After reading through the contract, some of the details were shocking: There were a total of 12 biweekly payments of 210$ for a total of $2520. That's for a $1000 loan. The interest was only 12% per year but there were hidden fees of $1800. This is broad daylight robbery and i dont know how this allowed by the authorities. Thankfully he didn’t sign but this is absolutely shocking. PS. The company is called mynextpay.",
  },
  {
    "title": "I am getting buried in a horrible cycle of payday loans and overdrafting my bank account. I need some help, so I know how to get out of it.",
    "subreddit": "personalfinance",
    "date": "2013-04-01",
    "url": "https://www.reddit.com/r/personalfinance/comments/1sr051/i_am_getting_buried_in_a_horrible_cycle_of_payday/",
    "text": "So, I'm going to try and be as specific as possible. I really need some help fixing my life :( First, here is what a typical month of bills looks like (I haven't included stuff like food, these are just the hard bills): List of bills - Calendar view. I make $20 an hour, and work the typical 40 hours a week. Each paycheck, after taxes, works out to somewhere around $1300 (some pay periods include an extra day or two, because we get paid twice a month not every other week). I would estimate my monthly income to be $2500-$2700 (this is all after taxes. Around $1300 that actually hits my account). Here's the issue: about 11 months ago I went unemployed for 2 months. I had to take out two huge payday loans to make ends meet. I now realize that was one of the biggest mistakes of my entire life. Please don't judge me for the payday loans, I've learned my lesson. One payday loan from one company is up to $1600, and the other is $800. Here are the specifics on these two loans (YES, IT'S HORRIBLE): The $1600 is from one company who charges $200 interest. If I wanted to go online and pay it all right now, the total damage would be just barely over $1800. Every payday, I can ask to extend the loan for another 2 weeks (til the next payday). This costs me $200. The other loan is $800, with a different company. Every payday, I have to pay $100 towards the loan and $100 towards interest, making it about $1600 to pay back as well. Problem is, I find myself not having any money, so after I pay back $100 or $200 on this loan, I end up borrowing that money right back, so this loan almost constantly sits at $800 due. Because of this, I'm losing about $400 from each paycheck. On top of this, because of bills that I pay each payday, I end up with $10 left over, or sometimes my account goes overdrawn immediately. Then, I need food and maybe gas for the week, so I end up spending around $100 or so in 2 or 3 places. Each time I overdraw, it hits me with a fee of $35. If I stay overdrawn for a week, another $35 fee is applied. God, just typing this is making me sick to my stomach. So, because of the bank fees + overdrawn balance + two payday loans, I would estimate that $600-$700 of each paycheck is gone before I even get access to it. Then I pay my bills, and the cycle continues. I have horrible credit, and I really don't know what to do. I feel like I'm just torpedoing out of control. Thank you so much for any/all help. :(",
  },
  {
    "title": "Need advice on payday loan consolidation - drowning in fees",
    "subreddit": "povertyfinance",
    "date": "2025-03-01",
    "url": "https://www.reddit.com/r/povertyfinance/comments/1jdlcjp/need_advice_on_payday_loan_consolidation_drowning/",
    "text": "So I've dug myself into a mess with payday loans. Started with one when my car broke down, then another when rent was due, and now I'm caught in this cycle of paying off one loan with another. The interest is INSANE. Currently juggling: - $600 loan at 400% APR (due next week) - $450 loan at 380% APR (due in 2 weeks) - $300 loan at 350% APR (just took this out yesterday) Basically all my paycheck goes to these loans and I can barely afford groceries at this point. Credit score is trash (540) so not sure if traditional loans are even an option. Has anyone successfully consolidated payday loans? What companies are legit vs scams? Any govt programs I should know about? I know I messed up getting into this cycle, but I'm desperate to break free. Working retail full-time plus gig work on weekends, so I'm trying, but these interest rates are killing me. Any advice that isn't 'go back in time and don't take the loans' would be super appreciated. EDIT: I was able to use consumer credit card relief and get a payday loan that I later paid off with an inheritance.",
  },
  {
    "title": "Accidentally took a tribal loan with an APR of 653%. What can I do?",
    "subreddit": "personalfinance",
    "date": "2022-04-01",
    "url": "https://www.reddit.com/r/personalfinance/comments/x5kw4k/accidentally_took_a_tribal_loan_with_an_apr_of/",
    "text": "Hello, I made the horrible mistake of taking this insane loan. I understand I should have read the fine print, this is first experience making a decision like this and I now realize how financially illiterate I am. It is an installment loan through river-valley loans. It has a maximum of 20 installments but it says there is no penalty for paying off early. I should have the money to pay this off within three days if I’m only paying for three days of interest; however, I can’t find the option to pre-pay anywhere. I believe this to be intentional difficult and any assistance will be greatly appreciated. Does anyone have experience with rivervalleyloans? Freaking out here, I can’t live with myself if I know I’m paying an extra $1700 for nothing over the next months. I need to pay this off ASAP and I’m not sure how. Edit: Here is the agreement with my information removed: https://imgur.com/a/WP9SlPB Edit 2: I’m restating here what I asked another commenter. My situation is: I got the loan and immediately received funds Sunday. I will not have the Money I need until Wednesday. Since I received the money Sunday and it’s stated I have two days to cancel the loan, would this Wednesday at 5pm since Monday is a bank holiday (Labor day?) again, any assistance will be hugely appreciated. Last resort, I could sell some personal belongings and have the funds available Tuesday, but this is not guaranteed. However, if cancelling is the only way I can avoid the full interest charges, I will have to make this work.",
  },
  {
    "title": "Forbidden Path",
    "subreddit": "povertyfinance",
    "date": "2023-04-01",
    "url": "https://www.reddit.com/r/povertyfinance/comments/141llie/forbidden_path/",
    "text": "I’m in a terrible position in my life financially to where I have no choice but to take a payday loan. I’ve exhausted all of my options; sold everything I have, asked family and friends for money, contacted assistance programs even tried donating plasma etc. but it looks like these predatory loaners are my last resort. Before anyone tries to get on me I take full accountability for the position I put myself in. I’m not looking for pity or judgment from you. I simply want to no how I can go about this situation the best I can. I have an interview for a good paying job this Thursday where I will be making around 4.5k a month. I’ll be using the loan($400)to fix my car. Lack of transportation is most of the reason why I’m in this predicament. Here are the loan details: Loan-$400 Apr-490% 10 monthly payments of 169 I’m confident I’ll be able to pay the principal and interest within the first month but I’m confused on how much exactly I would have to pay. Is the 10 monthly payments a guarantee or is that only if I don’t pay back the principal amount? Will I be able to do this without them trying to play me? Finally, has anyone had experience with payday loans, if so how did you get out of that hole?",
  }
]
