{
  "title": "Predatory Tribal Loans from the Internet - what to do to break out of the cycle",
  "author": "MysticAngel1500",
  "subreddit": "Debt",
  "date": "2023-10-20",  // approximate based on “6 mo ago” from April 2024
  "url": "https://www.reddit.com/r/Debt/comments/1glwt7l/predatory_tribal_loans_from_the_internet_what_to/",
  "text": "Tribal loans - can you really just stop paying them and forget them? The biggest concern is that they have arbitration agreements and I am concerned about being sued, taken to court, having wages garnished, being sent to collections, etc.\n\nI have never been in debt. I took 4 small loans (less than $1,000) each to try to get quick money to pay off medical and hospital bills. Turns out these are predatory scams. No wonder they were instant approval.\n\nI've seen advice that says these are not enforceable and you should just block payment and revoke ACH then challenge it if it goes to collections. Can I really do that? Don't I at least owe the original money I borrowed? Or is it just 'free money' then?\n\nHere is what it breaks down to -\n\nThree Sticks Lending - borrowed $700. Payments are $187.46 every 2 weeks\nAscend Loans - borrowed $600. Payments are $145.17 every 2 weeks\nSpotloan - borrowed $500. Payments are $91.14 every 2 weeks\nPost Lake Lending - borrowed $600. Payments are $90.96 every 2 weeks\n\nRates are 600% to nearly 780%.\n\nI did sign their online terms to agreement and stuff so does that mean I am legally obligated to pay?\n\nOnce I go back to work full time, I could pay them off quickly. Would that be better and easier than the hassle of non-payment?\n\nI am currently still on maternity leave not making full pay, so I can't pay any off RIGHT now but I will be able to soon. Should I really just ignore them?\n\nI called my bank and got a stop payment on all 4. So do I just ignore all debt attempts now? Are they going to try to sue me? Will I be ok just ignoring them and not paying?\n\nI am from Ohio btw\n\nThis is definitely something I will never ever do again. I am just worried now that I've signed the documents, they will be able to take me to court, garnish my wages since they know where I work or my credit will be ruined if I do stop paying them.\n\nI saw another story on here about predatory loans like these that said they stopped paying them, blocked their number/email and literally never heard from them again and had no issue. Is that really that simple? I'm so scared about not paying them. I'm scared I even did the stop payment. I feel like they're going to file legal action against me and really get me in trouble.\n\nMy bank said if the stop is successful, I won't lose the money, but if we had a bonding agreement and the stop is unsuccessful, then it'll still be taken from my account.\n\nAnyone that can offer input would be appreciated. I feel so stupid! I just wanted to quickly pay off my medical bills.\n\nEdit - I have stopped payment on all 4 loans from my bank and also called them to revoke ACH. 2 of them have sent email confirmation that the ACH was revoked."
}
